################################################################################
# Warning: this is an internal database file and is not intended for other usage
################################################################################
################################################################################
#
# Created by icc2 (T-2022.03-SP4) internalDesignWriter on Fri May 30 15:55:48 2025
#
################################################################################

################################################################################
#
# Units
# time_unit               : 1e-09
# resistance_unit         : 1000000
# capacitive_load_unit    : 1e-15
# voltage_unit            : 1
# current_unit            : 1e-06
# power_unit              : 1e-12
################################################################################

# Implemented: supplies

set_design_attributes -elements . -internal_attribute _mv_data_file_version 1
## Start - load_upf -noecho /home1/BPPD08/JhanaviD/VLSI_PD/Raven_soc/raven_top/pnr/work/raven_soc1/raven_soc/design_label.power_plan/design.upf on Fri May 30 15:42:21 2025

## Start - load_upf /home1/BPPD08/JhanaviD/VLSI_PD/Raven_soc/raven_top/synth/scripts/raven_soc.upf on Thu May 29 15:09:09 2025
#load_upf /home1/BPPD08/JhanaviD/VLSI_PD/Raven_soc/simpleuart/synth/scripts/simple_uart.upf  -scope simpleuart
#load_upf /home1/BPPD08/JhanaviD/VLSI_PD/Raven_soc/simpleuart/synth/scripts/spimemio.upf -scope spimemio
#create_power_domain PD -include_scope

#create_power_domain -elements simpleuart -include_scope PD
#create_power_domain -elements spimemio -include_scope PDm


#create_supply_port  VDD -domain PD -direction in 
#create_supply_port  VDDH -domain PD -direction in 
#create_supply_port  VSS -domain PD -direction in 



#create_supply_net VDD 
#create_supply_net VSS 
#create_supply_net VDDH 

#connect_supply_net VDD -ports {VDD simpleuart/VDD spimemio/VDDo}
#connect_supply_net VSS -ports {VSS simpleuart/VSS spimemio/VSS}
#connect_supply_net VDDH -ports {VDDH spimemio/VDD}

#set_domain_supply_net PD -primary_power_net VDD \
                   #-primary_ground_net VSS \

create_supply_net VDD
create_supply_net VSS
create_supply_net VDDH


#create_supply_set LOW -function {power VDD} -function {ground VSS}

#create_supply_set HIGH -function {power VDDH} -function {ground VSS}


create_power_domain PD -include_scope


create_supply_port VDD -direction in
create_supply_port VSS -direction in
create_supply_port VDDH -direction in

connect_supply_net VSS -ports {VSS simpleuart/VSS spimemio/VSS}
connect_supply_net VDD -ports {VDD simpleuart/VDD spimemio/VDDo}
connect_supply_net VDDH -ports {VDDH spimemio/VDD}

set_domain_supply_net PD -primary_power_net VDD  \
    -primary_ground_net VSS

#set_domain_supply_net -primary_power_net VDD -primary_ground_net VSS simpleuart/PD

#set_domain_supply_net -primary_power_net VDDH -primary_ground_net VSS spimemio/PDm
## End - load_upf /home1/BPPD08/JhanaviD/VLSI_PD/Raven_soc/raven_top/synth/scripts/raven_soc.upf
## Start - load_upf /home1/BPPD08/JhanaviD/VLSI_PD/Raven_soc/raven_top/synth/outputs/raven_soc.supplement.upf on Thu May 29 15:09:09 2025
## End - load_upf /home1/BPPD08/JhanaviD/VLSI_PD/Raven_soc/raven_top/synth/outputs/raven_soc.supplement.upf
## End - load_upf -noecho /home1/BPPD08/JhanaviD/VLSI_PD/Raven_soc/raven_top/pnr/work/raven_soc1/raven_soc/design_label.power_plan/design.upf

## Constraints below are generated by snps. Please do not modify.
set derived_upf true

if ($derived_upf) {

connect_supply_net VDD -ports {cfgreg_do_8__UPF_LS/VDDL \
    cfgreg_do_9__UPF_LS/VDDL cfgreg_do_10__UPF_LS/VDDL \
    cfgreg_do_11__UPF_LS/VDDL cfgreg_do_16__UPF_LS/VDDL \
    cfgreg_do_17__UPF_LS/VDDL cfgreg_do_18__UPF_LS/VDDL \
    cfgreg_do_19__UPF_LS/VDDL cfgreg_do_20__UPF_LS/VDDL \
    cfgreg_do_21__UPF_LS/VDDL cfgreg_do_22__UPF_LS/VDDL \
    cfgreg_do_31__UPF_LS/VDDL rdata_0__UPF_LS/VDDL rdata_1__UPF_LS/VDDL \
    rdata_2__UPF_LS/VDDL rdata_3__UPF_LS/VDDL rdata_4__UPF_LS/VDDL \
    rdata_5__UPF_LS/VDDL rdata_6__UPF_LS/VDDL rdata_7__UPF_LS/VDDL \
    rdata_8__UPF_LS/VDDL rdata_9__UPF_LS/VDDL rdata_10__UPF_LS/VDDL \
    rdata_11__UPF_LS/VDDL rdata_12__UPF_LS/VDDL rdata_13__UPF_LS/VDDL \
    rdata_14__UPF_LS/VDDL rdata_15__UPF_LS/VDDL rdata_16__UPF_LS/VDDL \
    rdata_17__UPF_LS/VDDL rdata_18__UPF_LS/VDDL rdata_19__UPF_LS/VDDL \
    rdata_20__UPF_LS/VDDL rdata_21__UPF_LS/VDDL rdata_22__UPF_LS/VDDL \
    rdata_23__UPF_LS/VDDL rdata_24__UPF_LS/VDDL rdata_25__UPF_LS/VDDL \
    rdata_26__UPF_LS/VDDL rdata_27__UPF_LS/VDDL rdata_28__UPF_LS/VDDL \
    rdata_29__UPF_LS/VDDL rdata_30__UPF_LS/VDDL rdata_31__UPF_LS/VDDL \
    ready_UPF_LS/VDDL flash_io3_do_UPF_LS/VDDL flash_io2_do_UPF_LS/VDDL \
    flash_io1_do_UPF_LS/VDDL flash_io0_do_UPF_LS/VDDL flash_io3_oeb_UPF_LS/VDDL \
    flash_io2_oeb_UPF_LS/VDDL flash_io1_oeb_UPF_LS/VDDL \
    flash_io0_oeb_UPF_LS/VDDL cfgreg_do_4__UPF_LS/VDDL flash_clk_UPF_LS/VDDL \
    cfgreg_do_5__UPF_LS/VDDL flash_csb_UPF_LS/VDDL}
connect_supply_net VSS -ports {cfgreg_do_8__UPF_LS/VSS cfgreg_do_9__UPF_LS/VSS \
    cfgreg_do_10__UPF_LS/VSS cfgreg_do_11__UPF_LS/VSS cfgreg_do_16__UPF_LS/VSS \
    cfgreg_do_17__UPF_LS/VSS cfgreg_do_18__UPF_LS/VSS cfgreg_do_19__UPF_LS/VSS \
    cfgreg_do_20__UPF_LS/VSS cfgreg_do_21__UPF_LS/VSS cfgreg_do_22__UPF_LS/VSS \
    cfgreg_do_31__UPF_LS/VSS rdata_0__UPF_LS/VSS rdata_1__UPF_LS/VSS \
    rdata_2__UPF_LS/VSS rdata_3__UPF_LS/VSS rdata_4__UPF_LS/VSS \
    rdata_5__UPF_LS/VSS rdata_6__UPF_LS/VSS rdata_7__UPF_LS/VSS \
    rdata_8__UPF_LS/VSS rdata_9__UPF_LS/VSS rdata_10__UPF_LS/VSS \
    rdata_11__UPF_LS/VSS rdata_12__UPF_LS/VSS rdata_13__UPF_LS/VSS \
    rdata_14__UPF_LS/VSS rdata_15__UPF_LS/VSS rdata_16__UPF_LS/VSS \
    rdata_17__UPF_LS/VSS rdata_18__UPF_LS/VSS rdata_19__UPF_LS/VSS \
    rdata_20__UPF_LS/VSS rdata_21__UPF_LS/VSS rdata_22__UPF_LS/VSS \
    rdata_23__UPF_LS/VSS rdata_24__UPF_LS/VSS rdata_25__UPF_LS/VSS \
    rdata_26__UPF_LS/VSS rdata_27__UPF_LS/VSS rdata_28__UPF_LS/VSS \
    rdata_29__UPF_LS/VSS rdata_30__UPF_LS/VSS rdata_31__UPF_LS/VSS \
    ready_UPF_LS/VSS flash_io3_do_UPF_LS/VSS flash_io2_do_UPF_LS/VSS \
    flash_io1_do_UPF_LS/VSS flash_io0_do_UPF_LS/VSS flash_io3_oeb_UPF_LS/VSS \
    flash_io2_oeb_UPF_LS/VSS flash_io1_oeb_UPF_LS/VSS flash_io0_oeb_UPF_LS/VSS \
    cfgreg_do_4__UPF_LS/VSS flash_clk_UPF_LS/VSS cfgreg_do_5__UPF_LS/VSS \
    flash_csb_UPF_LS/VSS}
connect_supply_net VDDH -ports {cfgreg_do_8__UPF_LS/VDDH \
    cfgreg_do_9__UPF_LS/VDDH cfgreg_do_10__UPF_LS/VDDH \
    cfgreg_do_11__UPF_LS/VDDH cfgreg_do_16__UPF_LS/VDDH \
    cfgreg_do_17__UPF_LS/VDDH cfgreg_do_18__UPF_LS/VDDH \
    cfgreg_do_19__UPF_LS/VDDH cfgreg_do_20__UPF_LS/VDDH \
    cfgreg_do_21__UPF_LS/VDDH cfgreg_do_22__UPF_LS/VDDH \
    cfgreg_do_31__UPF_LS/VDDH rdata_0__UPF_LS/VDDH rdata_1__UPF_LS/VDDH \
    rdata_2__UPF_LS/VDDH rdata_3__UPF_LS/VDDH rdata_4__UPF_LS/VDDH \
    rdata_5__UPF_LS/VDDH rdata_6__UPF_LS/VDDH rdata_7__UPF_LS/VDDH \
    rdata_8__UPF_LS/VDDH rdata_9__UPF_LS/VDDH rdata_10__UPF_LS/VDDH \
    rdata_11__UPF_LS/VDDH rdata_12__UPF_LS/VDDH rdata_13__UPF_LS/VDDH \
    rdata_14__UPF_LS/VDDH rdata_15__UPF_LS/VDDH rdata_16__UPF_LS/VDDH \
    rdata_17__UPF_LS/VDDH rdata_18__UPF_LS/VDDH rdata_19__UPF_LS/VDDH \
    rdata_20__UPF_LS/VDDH rdata_21__UPF_LS/VDDH rdata_22__UPF_LS/VDDH \
    rdata_23__UPF_LS/VDDH rdata_24__UPF_LS/VDDH rdata_25__UPF_LS/VDDH \
    rdata_26__UPF_LS/VDDH rdata_27__UPF_LS/VDDH rdata_28__UPF_LS/VDDH \
    rdata_29__UPF_LS/VDDH rdata_30__UPF_LS/VDDH rdata_31__UPF_LS/VDDH \
    ready_UPF_LS/VDDH flash_io3_do_UPF_LS/VDDH flash_io2_do_UPF_LS/VDDH \
    flash_io1_do_UPF_LS/VDDH flash_io0_do_UPF_LS/VDDH flash_io3_oeb_UPF_LS/VDDH \
    flash_io2_oeb_UPF_LS/VDDH flash_io1_oeb_UPF_LS/VDDH \
    flash_io0_oeb_UPF_LS/VDDH cfgreg_do_4__UPF_LS/VDDH flash_clk_UPF_LS/VDDH \
    cfgreg_do_5__UPF_LS/VDDH flash_csb_UPF_LS/VDDH}

set_design_attributes -elements . -internal_attribute _mv_data_status ready
set_design_attributes -elements . -internal_attribute _ldi_supply_nets {VDD \
    VDDH VSS} -internal_attribute _ldi_domains {{PD+VDD+VSS}}

}
set derived_upf false
